---
kind: type
id: T:Autodesk.Revit.ApplicationServices.ProductType
source: html/819ac6c7-9b44-e99d-7d5a-e9a106013d13.htm
---
# Autodesk.Revit.ApplicationServices.ProductType

An enumerated type containing the possible Revit product types.

## Syntax (C#)
```csharp
public enum ProductType
```